a = int(input("Введите первую сторону: "))
b = int(input("Введите вторую сторону: "))
c = int(input("Введите третью сторону: "))

p = (a + b + c) / 2

m_a = ((2 * b ** 2 + 2 * c ** 2 - a ** 2) / 4) ** (1 / 2)
m_b = ((2 * a ** 2 + 2 * c ** 2 - b ** 2) / 4) ** (1 / 2)
m_c = ((2 * a ** 2 + 2 * b ** 2 - c ** 2) / 4) ** (1 / 2)

h_a = 2 * ((p * (p - a) * (p - b) * (p - c)) ** (1 / 2)) / a
h_b = 2 * ((p * (p - a) * (p - b) * (p - c)) ** (1 / 2)) / b
h_c = 2 * ((p * (p - a) * (p - b) * (p - c)) ** (1 / 2)) / c

l_a = 2 * ((b * c * p * (p - a)) ** (1 / 2)) / (b + c)
l_b = 2 * ((a * c * p * (p - b)) ** (1 / 2)) / (a + c)
l_c = 2 * ((a * b * p * (p - c)) ** (1 / 2)) / (a + b)

print("Медиана проведенная к стороне а: ", m_a)
print("Медиана проведенная к стороне b: ", m_b)
print("Медиана проведенная к стороне c: ", m_c)

print("Высота проведенная к стороне а: ", h_a)
print("Высота проведенная к стороне b: ", h_b)
print("Высота проведенная к стороне c: ", h_c)

print("Биссектриса проведенная к стороне a: ", l_a)
print("Биссектриса проведенная к стороне b: ", l_b)
print("Биссектриса проведенная к стороне c: ", l_c)
